# Project 6: Importing & Merging many files (Baby Names Dataset) - Part 1

# Project Brief for Self-Coders

Here you´ll have the opportunity to code major parts of Project 6 (Part 1) on your own. If you need any help or inspiration, have a look at the Videos or the Jupyter Notebook with the full code. <br> <br>
Keep in mind that it´s all about __getting the right results/conclusions__. It´s not about finding the identical code. Things can be coded in many different ways. Even if you come to the same conclusions, it´s very unlikely that we have the very same code.

## Getting the Files from the Web

The data was downloaded from https://catalog.data.gov/dataset/baby-names-from-social-security-card-applications-national-level-data. You will find them in the zip file.

## Importing one File & Understanding the Data Structure

2. __Load__ the file __"yob1880.txt"__ into Pandas and __inspect__.

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv( "yob1880.txt")

In [3]:
df

           Mary  F  7065
0          Anna  F  2604
1          Emma  F  2003
2     Elizabeth  F  1939
3        Minnie  F  1746
4      Margaret  F  1578
...         ... ..   ...
1994     Woodie  M     5
1995     Worthy  M     5
1996     Wright  M     5
1997       York  M     5
1998  Zachariah  M     5

[1999 rows x 3 columns]

In [4]:
df = pd.read_csv( "yob1880.txt", header=None, names=['Name','Gender','Count'])

In [5]:
df

           Name Gender  Count
0          Mary      F   7065
1          Anna      F   2604
2          Emma      F   2003
3     Elizabeth      F   1939
4        Minnie      F   1746
...         ...    ...    ...
1995     Woodie      M      5
1996     Worthy      M      5
1997     Wright      M      5
1998       York      M      5
1999  Zachariah      M      5

[2000 rows x 3 columns]

## Importing & merging many files (easy case)

3. __Load__ all files (yob????.txt) and __merge/concatenate__ all files into one Pandas DataFrame. Make sure you add the __column "Year"__.

In [9]:
years = list(range(1880,2019))
Dataframes = []

for year in years:
    data = pd.read_csv('yob{}.txt'.format(year), header=None, names=['Name','Gender','Count'])
    Dataframes.append(data)

In [37]:
df = pd.concat(Dataframes, keys=years, names=['Year']).droplevel(-1)

In [38]:
df

           Name Gender  Count
Year
1880       Mary      F   7065
1880       Anna      F   2604
1880       Emma      F   2003
1880  Elizabeth      F   1939
1880     Minnie      F   1746
...         ...    ...    ...
2018      Zylas      M      5
2018      Zyran      M      5
2018      Zyrie      M      5
2018      Zyron      M      5
2018      Zzyzx      M      5

[1957046 rows x 3 columns]

4. Create a __RangeIndex__ and __save__ the DataFrame (with columns "Year", "Name", "Gender" and "Count") in a new csv-file.

In [39]:
df =df.reset_index()

In [41]:
df.to_csv("Yob_combined_data.csv", index=False)

# +++++++++ See some Hints below +++++++++++++

# ++++++++++++++++ Hints++++++++++++++++++++

__Hints for 2.__ <br>
You can use pd.read_csv(). You need to add appropriate column headers (e.g. "Name", "Gender", "Count")

__Hints for 3.__<br>
Use a for loop and pd.concat().